fix: replace plantuml
